app/Controllers/PromotionsController.php

SELECT *
FROM `promotions`
---
    public function index()
    {
        $promotionsModel = new PromotionsModel();
        $result = $promotionsModel->findAll();

SELECT *
FROM `promotions`
WHERE `promotions`.`id` = '1'
---
    public function edit($id = null)
    {
        if($id == null){
            return redirect()->route('promos');
        }

        $promotionsModel = new PromotionsModel();
        $result = $promotionsModel->find($id);